# Taps
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# Development
brew 'yarn'

# Java JDKs
cask 'zulu8'
cask 'zulu21'

# Apps
cask 'herd'
cask '1password'
cask '1password-cli'
cask 'mac-mouse-fix'
cask 'cleanshot'
cask 'discord'
cask 'google-chrome'
cask 'github'
cask 'jetbrains-toolbox'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'orbstack'
cask 'rapidapi'
cask 'minecraft'
cask 'figma'
cask 'openvpn-connect'
cask 'slack'

# Mac App Store
mas 'Things 3', id: 904280696
mas 'Magnet', id: 441258766
mas 'Yubico Authenticator', id: 1497506650
mas 'Speedtest', id: 1153157709
